[Killed] BlockStatement
src/services/calculator.services.ts:8:54
 
 export class CalculatorService implements ICalculatorService {
 
-    async add(a: number, b: number): Promise<number> {
-        return a + b;
-    
-    }
+    async add(a: number, b: number): Promise<number> {}
     async sub(a: number, b: number): Promise<number> {
         return a - b;
killedBy: CalculatorService should add tow numbers correctly
statusReason: expected undefined to be 15 // Object.is equality

[Killed] ArithmeticOperator
src/services/calculator.services.ts:9:16
 export class CalculatorService implements ICalculatorService {
 
     async add(a: number, b: number): Promise<number> {
-        return a + b;
+        return a - b;
     
     }
killedBy: CalculatorService should add tow numbers correctly
statusReason: expected -5 to be 15 // Object.is equality

[Killed] BlockStatement
src/services/calculator.services.ts:12:54
         return a + b;
     
     }
-    async sub(a: number, b: number): Promise<number> {
-        return a - b;
-    
-    }
+    async sub(a: number, b: number): Promise<number> {}
     async multipli(a: number, b: number): Promise<number> {
         return a * b;
killedBy: CalculatorService should sub tow numbers correctly
statusReason: expected undefined to be -5 // Object.is equality

[Killed] ArithmeticOperator
src/services/calculator.services.ts:13:16
     
     }
     async sub(a: number, b: number): Promise<number> {
-        return a - b;
+        return a + b;
     
     }
killedBy: CalculatorService should sub tow numbers correctly
statusReason: expected 15 to be -5 // Object.is equality

[NoCoverage] BlockStatement
src/services/calculator.services.ts:16:59
         return a - b;
     
     }
-    async multipli(a: number, b: number): Promise<number> {
-        return a * b;
-    
-    }
+    async multipli(a: number, b: number): Promise<number> {}
     async division(a: number, b: number): Promise<number> {
         if ( b === 0 ){

[NoCoverage] ArithmeticOperator
src/services/calculator.services.ts:17:16
     
     }
     async multipli(a: number, b: number): Promise<number> {
-        return a * b;
+        return a / b;
     
     }

[Killed] BlockStatement
src/services/calculator.services.ts:20:59
         return a * b;
     
     }
-    async division(a: number, b: number): Promise<number> {
-        if ( b === 0 ){
-
-            throw new Error("Error, no se puede dividir por cero")
-        }
-       
-        return a / b;
-    
-    }
+    async division(a: number, b: number): Promise<number> {}
 
 
killedBy: CalculatorService should division tow numbers correctly
statusReason: expected undefined to be 0.5 // Object.is equality

[Killed] BlockStatement
src/services/calculator.services.ts:21:23
     
     }
     async division(a: number, b: number): Promise<number> {
-        if ( b === 0 ){
-
-            throw new Error("Error, no se puede dividir por cero")
-        }
+        if ( b === 0 ){}
        
         return a / b;
killedBy: CalculatorService should division tow numbers error
statusReason: promise resolved "Infinity" instead of rejecting

[Killed] ConditionalExpression
src/services/calculator.services.ts:21:14
     
     }
     async division(a: number, b: number): Promise<number> {
-        if ( b === 0 ){
+        if ( false ){
 
             throw new Error("Error, no se puede dividir por cero")
killedBy: CalculatorService should division tow numbers error
statusReason: promise resolved "Infinity" instead of rejecting

[Killed] ArithmeticOperator
src/services/calculator.services.ts:26:16
             throw new Error("Error, no se puede dividir por cero")
         }
        
-        return a / b;
+        return a * b;
     
     }
killedBy: CalculatorService should division tow numbers correctly
statusReason: expected 50 to be 0.5 // Object.is equality
