[NoCoverage] BlockStatement
src/services/person.services.ts:5:73
 
 export class PersonService implements PersonService{
 
-    async FullPerson(name: string, lastName: string,): Promise <string> {
-        
-        return `${name} ${lastName}`;
-
-    }
+    async FullPerson(name: string, lastName: string,): Promise <string> {}
 }
